In [1]:
import pandas as pd
import os

In [4]:
curr_dir = os.getcwd()
data_path = os.path.join(curr_dir, "titanic.csv")
data_df = pd.read_csv(data_path) #Reading data from disk

Sanity Check

In [5]:
data_df.shape  # Checking how Data Sanity Check (Rows&columns)

(891, 12)

In [6]:
data_df.head(4) #what the first few rows looks like to observe data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [7]:
data_df.columns #giving the list of columns in the data

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
list(data_df.columns) #"Type casting" giving the list of cloumns instead

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [9]:
data_df.dtypes #The types of data types  available (object datatype, python not sure what data it is)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Data Columns Exploration

In [10]:
data_df["Age"].head(3)  #The first 3 rows of the data i.e age (this is a 1 dimensional data frame)

0    22.0
1    38.0
2    26.0
Name: Age, dtype: float64

In [12]:
data_df["Survived"].tail(3) # Survived/did not passengers

888    0
889    1
890    0
Name: Survived, dtype: int64

In [13]:
data_df[["Age", "Survived"]].head(3) #Accessing multiple columns 2D data frame

    Age  Survived
0  22.0         0
1  38.0         1
2  26.0         1

In [15]:
cols = ["Name", "Survived", "Age", "Embarked"] #Choosing to see the columns we want to see and not others

In [16]:
data_df[cols] #sliced data frame, this is a new data frame we have created but its not saved, how do we do that, see below.

,Name,Survived,Age,Embarked
0,"Braund, Mr. Owen Harris",0,22.0,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,C
2,"Heikkinen, Miss. Laina",1,26.0,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,S
4,"Allen, Mr. William Henry",0,35.0,S
...,...,...,...,...
886,"Montvila, Rev. Juozas",0,27.0,S
887,"Graham, Miss. Margaret Edith",1,19.0,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,S
889,"Behr, Mr. Karl Howell",1,26.0,C
890,"Dooley, Mr. Patrick",0,32.0,Q

In [19]:
data_new = data_df[cols] #new data frame with our selected columns we want to see from above as a new dataframe to use from now on

In [20]:
data_new  #This is now the new data frame, notice the *new from the word data_new?

,Name,Survived,Age,Embarked
0,"Braund, Mr. Owen Harris",0,22.0,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,C
2,"Heikkinen, Miss. Laina",1,26.0,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,S
4,"Allen, Mr. William Henry",0,35.0,S
...,...,...,...,...
886,"Montvila, Rev. Juozas",0,27.0,S
887,"Graham, Miss. Margaret Edith",1,19.0,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,S
889,"Behr, Mr. Karl Howell",1,26.0,C
890,"Dooley, Mr. Patrick",0,32.0,Q

In [21]:
data_new = data_df[cols].copy() #we now have two data frame one called data_df and now data_new, we are now cipying the view of the subselcted data frame i.e the columns we have specified above. So from this the two are now different from each other through the copy without affecting data_df

Row Accesing

In [78]:
age_thr = 10.0  # Age threshold

In [61]:
type(data_df["Age"]) #one dimensional data series

pandas.core.series.Series

In [69]:
data_df["Age"] #boolean mask not working try an revisit

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [76]:
data_df["Age"] < age_thr # we are checking to see passengers ages under 10 as above declared and it returns a boolean True or False by comparing the index i.e 0,1,2 as above.

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [79]:
boolean_mask = data_df["Age"] < age_thr

In [80]:
data_df[boolean_mask] #Boolean mask is deciding what rows to show and what rows not to show based on our Trur and False, for example its skipping 8 and 9 based on Tr or Fl

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.00,3,1,349909,21.0750,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,1,PP 9549,16.7000,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.00,4,1,382652,29.1250,NaN,Q
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.00,3,1,349909,21.0750,NaN,S
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
827,828,1,2,"Mallet, Master. Andre",male,1.00,0,2,S.C./PARIS 2079,37.0042,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
852,853,0,3,"Boulos, Miss. Nourelain",female,9.00,1,1,2678,15.2458,NaN,C
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.00,1,1,347742,11.1333,NaN,S

In [81]:
list[boolean_mask] #slicing rows giving a list of true or flase as explain above, true shown not true not shown

list[0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool]

In [82]:
data_new_rows = data_df[boolean_mask]

In [83]:
data_new_rows.shape #we want to see passengers under the age of 10

(62, 12)

In [84]:
data_new_rows = data_df[boolean_mask].copy() #new data frame of boolean mask, instead of looking at all the rows, we are creating a new data frame to see what we want

In [85]:
#So far we created two data frame, one with only selcted columns and one with only selected rows

Slice the data frame

In [91]:
#data_df
cols = ["Name", "Survived", "Age", "Embarked"]
rows = data_df["Age"] <10

In [87]:
cols #Checking columns of new set

['Name', 'Survived', 'Age,Embarked']

In [88]:
rows #Checking rows of new set

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [92]:
data_filtered = data_df.loc[rows,cols] #Checking columns of new set we are getting both rows an columns and giving them a location

In [93]:
data_filtered.head(3)

                               Name  Survived  Age Embarked
7    Palsson, Master. Gosta Leonard         0  2.0        S
10  Sandstrom, Miss. Marguerite Rut         1  4.0        S
16             Rice, Master. Eugene         0  2.0        Q

In [94]:
data_filtered.shape

(62, 4)

Post Processing (saving to disk)

In [98]:
#we can check if this is a data frame by doing the below

In [97]:
type(data_filtered)

pandas.core.frame.DataFrame

In [99]:
data_path data.filtered #below is where our files are or data path is or where python is reading our data from

'/Users/hd/Documents/Data/Resources/titanic.csv'

In [101]:
os.getcwd() #this is our current working directory

'/Users/hd/Documents/Data/Resources'

In [104]:
out_path = os.path.join(os.getcwd(), "data_filtered.csv")

In [105]:
out_path

'/Users/hd/Documents/Data/Resources/data_filtered.csv'

In [106]:
type(data_filtered)

pandas.core.frame.DataFrame

In [108]:
data_filtered.to_csv(out_path, index=False) #Writing data to disk, data is now saved with the new file name "data_filtered.csv"